essays/predictive-markets.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>predictive-markets</title>
<!-- 2015-05-10 Sun 22:03 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Bender" />
<link rel="stylesheet" type="text/css" href="../assets/style.css" />
</head>
<body>
<div id="content">
<h1 class="title">predictive-markets</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. problem</a></li>
<li><a href="#sec-2">2. predictive markets</a></li>
<li><a href="#sec-3">3. example</a></li>
<li><a href="#sec-4">4. design decisions</a></li>
<li><a href="#sec-5">5. ad-hoc contracts</a></li>
<li><a href="#sec-6">6. further examples</a></li>
<li><a href="#sec-7">7. problems</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> problem</h2>
<div class="outline-text-2" id="text-1">
<p>
Arriving at a good system design requires a few things:
</p>
<ol class="org-ol">
<li>motivation, the programmer(s) must be motivated to design a good system
</li>
<li>experience, the programmer(s) must be capable of designing a good system
</li>
<li>foreknowledge, the programmer(s) must know enough about the project/goal/road-map
to design a system well.
</li>
</ol>

<p>
We focus here on the third requirement,
noting that we may in part or whole be addressing the second as well.
We leave "good system design" abstract for the moment.
</p>

<p>
In this case, even experts can't always predict how a
system will need to change during the course of its construction.
This might be due to a lack experience, time, or domain expertise.
In any case, this makes designing a system difficult.
If the choices one makes turn out to be incorrect the original effort spent
designing the system and implementing it for that design was wasted in part
and more effort must be expended to align to the "right" design.
</p>

<p>
We need a crystal ball! &#x2026; or at least a rough approximation.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> predictive markets</h2>
<div class="outline-text-2" id="text-2">
<p>
We will construct our crystal ball from a large collection of people
willing to bet money on how and when a system will change.
That is we will leverage the wisdom of the crowd motivated by money
to "divine" future system changes.
</p>

<p>
The scheme proceeds as follows:
</p>

<ol class="org-ol">
<li>Contracts will be sold on an exchange.
</li>
<li>Each contract has a duration, portion of the design, and type.
</li>
<li>Each pays unit value if the design changes within the time period, zero o/w.
</li>
</ol>

<p>
The cost of purchasing a contract on the exchange represents
the participant's prediction of the probability of change
for the targeted portion of the design before the time period is up.
That is, a participant who thinks that there is a 70% change a design feature
will change should be willing to pay 70 cents for that contract (expected value).
</p>

<p>
With this information in hand the programmer can evaluate their module boundaries for flaws.
In a way you might see this as hyper motivated code review.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> example</h2>
<div class="outline-text-2" id="text-3">
<p>
Consider the circular shift procedure from the first modularization
from the Parnas paper.
</p>

<p>
Parnas, participating in the market, knows that there are many reasons that
the first modularization might change. He's so sure he's willing to spend nearly
the contract pay-out since he'll make a dollar for each contract with near
certainty.
</p>

<p>
We might convey the change probability as a number or even a color in the code.
</p>

<div class="org-src-container">

<pre class="src src-ruby"><span style="color: #00cd00;">def</span> <span style="color: #0000ee;">shift</span>(lines) <span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">[0.8 (month)]</span>
  <span style="color: #00ffff; font-style: italic;"># </span><span style="color: #00ffff; font-style: italic;">...</span>
<span style="color: #00cd00;">end</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> design decisions</h2>
<div class="outline-text-2" id="text-4">
<p>
It's worth considering issuing contracts on a design document and not the code.
This might harness the crowd to review higher level concepts without getting bogged
down finding bugs or typos. For example, if a programmer misspells a variable name it's
fairly sure that the enclosing module will be changed but nothing interesting
is learned about design.
</p>

<p>
Along the same lines, what constitutes a change meaningful enough to trigger
a pay-out on the contract? Maybe if the tests change or the input/output relation?
</p>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> ad-hoc contracts</h2>
<div class="outline-text-2" id="text-5">
<p>
In many cases it may be advantageous to allow users to issue contracts based on
many different criteria beyond dates and changes. For example, asking generally whether
a method has a bug in it would be one way to quickly get many eyes on a method. Further,
interested crowds may wish to generate their own contracts if they find something of
note not covered by the programmers.
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> further examples</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li>storing time series data in a sql database, will change with scaling
</li>
<li>a poorly normalized database, will change with pain over time
</li>
<li>storing passwords in clear text, someone will notice and change
</li>
<li>functionality in controller methods, fat models convention, testing
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> problems</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>"insider trading", programmer gaming the system
</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Bender</p>
<p class="date">Created: 2015-05-10 Sun 22:03</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
